askn37/multix-zinnia-sdk-modernAVR/boards.txt
menu.01_variant=Variant
menu.02_clock=Clock(Dx)
menu.03_clock=Clock(Ex)
menu.11_BODMODE=BOD Mode
menu.12_BODLVL=BOD Level
menu.21_resetpin=FUSE PF6
menu.22_updipin=FUSE UPDI
menu.23_mvsyscfg=FUSE MVIO
menu.24_eeprom=EEPROM
menu.25_bootrow=BOOTROW
menu.26_userrow=USERROW
menu.27_fusefile=FUSE define
menu.51_buildopt=Build Option
menu.52_macroapi=Build API
menu.53_printf=Build "printf"
menu.54_console_select=Console and LED
menu.90_console_baud=Console
menu.95_bootloader=Bootloader
menu.96_usbbootloader=USB bootloader


AVRDB.name=AVR DB with Bootloader
AVRDB.build.board=AVR128DB64
AVRDB.build.core=modernAVR
AVRDA.name=AVR DA with Bootloader
AVRDA.build.board=AVR128DA64
AVRDA.build.core=modernAVR
AVRDD.name=AVR DD with Bootloader
AVRDD.build.board=AVR64DD32
AVRDD.build.core=modernAVR
AVRDU.name=AVR DU with Bootloader
AVRDU.build.board=AVR64DU32
AVRDU.build.core=modernAVR
AVREA.name=AVR EA with Bootloader
AVREA.build.board=AVR64EA32
AVREA.build.core=modernAVR
AVREB.name=AVR EB with Bootloader
AVREB.build.board=AVR32EB32
AVREB.build.core=modernAVR
AVRLA.name=AVR LA with Bootloader
AVRLA.build.board=AVR32LA32
AVRLA.build.core=modernAVR
separator1.name=-
separator1.build.board=-
AVRDU_usbloader.name=AVR DU with USB Bootloader
AVRDU_usbloader.build.board=AVR64DU32
AVRDU_usbloader.build.core=modernAVR
separator2.name=-
separator2.build.board=-
AVRDB_noloader.name=AVR DB w/o Bootloader
AVRDB_noloader.build.board=AVR128DB64
AVRDB_noloader.build.core=modernAVR
AVRDA_noloader.name=AVR DA w/o Bootloader
AVRDA_noloader.build.board=AVR128DA64
AVRDA_noloader.build.core=modernAVR
AVRDD_noloader.name=AVR DD w/o Bootloader
AVRDD_noloader.build.board=AVR64DD32
AVRDD_noloader.build.core=modernAVR
AVRDU_noloader.name=AVR DU w/o Bootloader
AVRDU_noloader.build.board=AVR64DU32
AVRDU_noloader.build.core=modernAVR
AVREA_noloader.name=AVR EA w/o Bootloader
AVREA_noloader.build.board=AVR64EA32
AVREA_noloader.build.core=modernAVR
AVREB_noloader.name=AVR EB w/o Bootloader
AVREB_noloader.build.board=AVR32EB32
AVREB_noloader.build.core=modernAVR
AVRLA_noloader.name=AVR LA w/o Bootloader
AVRLA_noloader.build.board=AVR32LA32
AVRLA_noloader.build.core=modernAVR
AVRSD_noloader.name=AVR SD w/o Bootloader
AVRSD_noloader.build.board=AVR32SD32
AVRSD_noloader.build.core=modernAVR


AVRDB.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDB.bootloader.OSCCFG=0x00
AVRDB.bootloader.PINCFG=0x00
AVRDB.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.eesave_bit}
AVRDB.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDB.bootloader.CODESIZE=0x00
AVRDB.bootloader.BOOTSIZE=0x01
AVRDB.bootloader.bod_lvl=000
AVRDB.bootloader.bod_mode=00
AVRDB.bootloader.bod_sample=0
AVRDB.bootloader.eepupload=
AVRDB.bootloader.browupload=
AVRDB.bootloader.urowupload=
AVRDB.bootloader.fuseupload={bootloader.fuses}
AVRDB.bootloader.eesave_bit=1
AVRDB.bootloader.mvsys_bit=01
AVRDB.bootloader.reset_bit=10
AVRDB.bootloader.updi_bit=1
AVRDB.bootloader.tool=avrdude
AVRDB.bootloader.programed_type=.with_bootloader
AVRDB.build.export_merged_output=true
AVRDB.build.text_section_start=.text=0x200
AVRDB.build.buildopt=-DNDEBUG
AVRDB.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB.build.macroapi=-DENABLE_MACRO_API
AVRDB.build.printf=
AVRDB.build.printflt=
AVRDB_noloader.build.f_cpu=24000000L
AVRDB_noloader.compiler.ldflags=
AVRDB_noloader.compiler.c.elf.extra_flags=
AVRDB.upload.protocol=arduino
AVRDB.upload.speed=115200
AVRDB.upload.tool=avrdude
AVRDB.menu.01_variant.01_AVR128DB64.build.board=AVR_AVR128DB64
AVRDB.menu.01_variant.01_AVR128DB64.build.mcu=avr128db64
AVRDB.menu.01_variant.01_AVR128DB64.build.variant=avr_db64
AVRDB.menu.01_variant.01_AVR128DB64.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega4_p512.x
AVRDB.menu.01_variant.01_AVR128DB64.upload.maximum_data_size=16384
AVRDB.menu.01_variant.01_AVR128DB64.upload.maximum_size=130560
AVRDB.menu.01_variant.01_AVR128DB64=64pin AVR128DB64 (128KiB+16KiB)
AVRDB.menu.01_variant.02_AVR64DB64.build.board=AVR_AVR64DB64
AVRDB.menu.01_variant.02_AVR64DB64.build.mcu=avr64db64
AVRDB.menu.01_variant.02_AVR64DB64.build.variant=avr_db64
AVRDB.menu.01_variant.02_AVR64DB64.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega2_p512.x
AVRDB.menu.01_variant.02_AVR64DB64.upload.maximum_data_size=8192
AVRDB.menu.01_variant.02_AVR64DB64.upload.maximum_size=65024
AVRDB.menu.01_variant.02_AVR64DB64=64pin AVR64DB64 (64KiB+8KiB)
AVRDB.menu.01_variant.10_separator=-
AVRDB.menu.01_variant.11_AVR128DB48.build.board=AVR_AVR128DB48
AVRDB.menu.01_variant.11_AVR128DB48.build.mcu=avr128db48
AVRDB.menu.01_variant.11_AVR128DB48.build.variant=avr_db48
AVRDB.menu.01_variant.11_AVR128DB48.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega4_p512.x
AVRDB.menu.01_variant.11_AVR128DB48.upload.maximum_data_size=16384
AVRDB.menu.01_variant.11_AVR128DB48.upload.maximum_size=130560
AVRDB.menu.01_variant.11_AVR128DB48=48pin AVR128DB48 (128KiB+16KiB)
AVRDB.menu.01_variant.12_AVR64DB48.build.board=AVR_AVR64DB48
AVRDB.menu.01_variant.12_AVR64DB48.build.mcu=avr64db48
AVRDB.menu.01_variant.12_AVR64DB48.build.variant=avr_db48
AVRDB.menu.01_variant.12_AVR64DB48.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega2_p512.x
AVRDB.menu.01_variant.12_AVR64DB48.upload.maximum_data_size=8192
AVRDB.menu.01_variant.12_AVR64DB48.upload.maximum_size=65024
AVRDB.menu.01_variant.12_AVR64DB48=48pin AVR64DB48 (64KiB+8KiB)
AVRDB.menu.01_variant.13_AVR32DB48.build.board=AVR_AVR32DB48
AVRDB.menu.01_variant.13_AVR32DB48.build.mcu=avr32db48
AVRDB.menu.01_variant.13_AVR32DB48.build.variant=avr_db48
AVRDB.menu.01_variant.13_AVR32DB48.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega3_p512.x
AVRDB.menu.01_variant.13_AVR32DB48.upload.maximum_data_size=4096
AVRDB.menu.01_variant.13_AVR32DB48.upload.maximum_size=32256
AVRDB.menu.01_variant.13_AVR32DB48=48pin AVR32DB48 (32KiB+4KiB)
AVRDB.menu.01_variant.20_separator=-
AVRDB.menu.01_variant.21_AVR128DB32.build.board=AVR_AVR128DB32
AVRDB.menu.01_variant.21_AVR128DB32.build.mcu=avr128db32
AVRDB.menu.01_variant.21_AVR128DB32.build.variant=avr_db32
AVRDB.menu.01_variant.21_AVR128DB32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega4_p512.x
AVRDB.menu.01_variant.21_AVR128DB32.upload.maximum_data_size=16384
AVRDB.menu.01_variant.21_AVR128DB32.upload.maximum_size=130560
AVRDB.menu.01_variant.21_AVR128DB32=32pin AVR128DB32 (128KiB+16KiB)
AVRDB.menu.01_variant.22_AVR64DB32.build.board=AVR_AVR64DB32
AVRDB.menu.01_variant.22_AVR64DB32.build.mcu=avr64db32
AVRDB.menu.01_variant.22_AVR64DB32.build.variant=avr_db32
AVRDB.menu.01_variant.22_AVR64DB32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega2_p512.x
AVRDB.menu.01_variant.22_AVR64DB32.upload.maximum_data_size=8192
AVRDB.menu.01_variant.22_AVR64DB32.upload.maximum_size=65024
AVRDB.menu.01_variant.22_AVR64DB32=32pin AVR64DB32 (64KiB+8KiB)
AVRDB.menu.01_variant.23_AVR32DB32.build.board=AVR_AVR32DB32
AVRDB.menu.01_variant.23_AVR32DB32.build.mcu=avr32db32
AVRDB.menu.01_variant.23_AVR32DB32.build.variant=avr_db32
AVRDB.menu.01_variant.23_AVR32DB32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega3_p512.x
AVRDB.menu.01_variant.23_AVR32DB32.upload.maximum_data_size=4096
AVRDB.menu.01_variant.23_AVR32DB32.upload.maximum_size=32256
AVRDB.menu.01_variant.23_AVR32DB32=32pin AVR32DB32 (32KiB+4KiB)
AVRDB.menu.01_variant.30_separator=-
AVRDB.menu.01_variant.31_AVR128DB28.build.board=AVR_AVR128DB28
AVRDB.menu.01_variant.31_AVR128DB28.build.mcu=avr128db28
AVRDB.menu.01_variant.31_AVR128DB28.build.variant=avr_db28
AVRDB.menu.01_variant.31_AVR128DB28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega4_p512.x
AVRDB.menu.01_variant.31_AVR128DB28.upload.maximum_data_size=16384
AVRDB.menu.01_variant.31_AVR128DB28.upload.maximum_size=130560
AVRDB.menu.01_variant.31_AVR128DB28=28pin AVR128DB28 (128KiB+16KiB)
AVRDB.menu.01_variant.32_AVR64DB28.build.board=AVR_AVR64DB28
AVRDB.menu.01_variant.32_AVR64DB28.build.mcu=avr64db28
AVRDB.menu.01_variant.32_AVR64DB28.build.variant=avr_db28
AVRDB.menu.01_variant.32_AVR64DB28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega2_p512.x
AVRDB.menu.01_variant.32_AVR64DB28.upload.maximum_data_size=8192
AVRDB.menu.01_variant.32_AVR64DB28.upload.maximum_size=65024
AVRDB.menu.01_variant.32_AVR64DB28=28pin AVR64DB28 (64KiB+8KiB)
AVRDB.menu.01_variant.33_AVR32DB28.build.board=AVR_AVR32DB28
AVRDB.menu.01_variant.33_AVR32DB28.build.mcu=avr32db28
AVRDB.menu.01_variant.33_AVR32DB28.build.variant=avr_db28
AVRDB.menu.01_variant.33_AVR32DB28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/variants//avrxmega3_p512.x
AVRDB.menu.01_variant.33_AVR32DB28.upload.maximum_data_size=4096
AVRDB.menu.01_variant.33_AVR32DB28.upload.maximum_size=32256
AVRDB.menu.01_variant.33_AVR32DB28=28pin AVR32DB28 (32KiB+4KiB)
AVRDB.menu.02_clock.01_24MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.01_24MHz.build.f_cpu=24000000L
AVRDB.menu.02_clock.01_24MHz=Internal 24 MHz (default)
AVRDB.menu.02_clock.01_12MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.01_12MHz.build.f_cpu=12000000L
AVRDB.menu.02_clock.01_12MHz=Internal 12 MHz
AVRDB.menu.02_clock.03_6MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.03_6MHz.build.f_cpu=6000000L
AVRDB.menu.02_clock.03_6MHz=Internal 6 MHz
AVRDB.menu.02_clock.04_3MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.04_3MHz.build.f_cpu=3000000L
AVRDB.menu.02_clock.04_3MHz=Internal 3 MHz
AVRDB.menu.02_clock.10_separator=-
AVRDB.menu.02_clock.11_20MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.11_20MHz.build.f_cpu=20000000L
AVRDB.menu.02_clock.11_20MHz=Internal 20 MHz
AVRDB.menu.02_clock.12_10MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.12_10MHz.build.f_cpu=10000000L
AVRDB.menu.02_clock.12_10MHz=Internal 10 MHz
AVRDB.menu.02_clock.13_5MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.13_5MHz.build.f_cpu=5000000L
AVRDB.menu.02_clock.13_5MHz=Internal 5 MHz
AVRDB.menu.02_clock.20_separator=-
AVRDB.menu.02_clock.21_16MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.21_16MHz.build.f_cpu=16000000L
AVRDB.menu.02_clock.21_16MHz=Internal 16 MHz
AVRDB.menu.02_clock.22_8MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.22_8MHz.build.f_cpu=8000000L
AVRDB.menu.02_clock.22_8MHz=Internal 8 MHz
AVRDB.menu.02_clock.23_4MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.23_4MHz.build.f_cpu=4000000L
AVRDB.menu.02_clock.23_4MHz=Internal 4 MHz
AVRDB.menu.02_clock.24_2MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.24_2MHz.build.f_cpu=2000000L
AVRDB.menu.02_clock.24_2MHz=Internal 2 MHz
AVRDB.menu.02_clock.25_1MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.25_1MHz.build.f_cpu=1000000L
AVRDB.menu.02_clock.25_1MHz=Internal 1 MHz
AVRDB.menu.02_clock.30_separator=-
AVRDB.menu.02_clock.31_32MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.31_32MHz.build.f_cpu=32000000L
AVRDB.menu.02_clock.31_32MHz=Internal 32 MHz (OVERCLOCK)
AVRDB.menu.02_clock.32_28MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.32_28MHz.build.f_cpu=28000000L
AVRDB.menu.02_clock.32_28MHz=Internal 28 MHz (OVERCLOCK)
AVRDB.menu.02_clock.33_14MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.33_14MHz.build.f_cpu=14000000L
AVRDB.menu.02_clock.33_14MHz=Internal 14 MHz (OVERCLOCK)
AVRDB.menu.02_clock.34_7MHz.bootloader.bod_sample=0
AVRDB.menu.02_clock.34_7MHz.build.f_cpu=7000000L
AVRDB.menu.02_clock.34_7MHz=Internal 7 MHz (OVERCLOCK)
AVRDB.menu.02_clock.40_separator=-
AVRDB.menu.02_clock.41_32768Hz.bootloader.bod_sample=1
AVRDB.menu.02_clock.41_32768Hz.build.f_cpu=32768
AVRDB.menu.02_clock.41_32768Hz=Internal 32.768 kHz (ULP)
# AVRDB.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
# AVRDB.menu.11_BODMODE.01_disabled=BOD Disabled
# AVRDB.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
# AVRDB.menu.11_BODMODE.02_enabled=BOD Enabled
# AVRDB.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
# AVRDB.menu.11_BODMODE.03_sampled=BOD Sampled
# AVRDB.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
# AVRDB.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
# AVRDB.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDB.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDB.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDB.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDB.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDB.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDB.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDB.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDB.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVRDB.menu.21_resetpin.01_reset=PF6 pin=Reset
AVRDB.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVRDB.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVRDB.menu.23_mvsyscfg.01_dual.bootloader.mvsys_bit=01
AVRDB.menu.23_mvsyscfg.01_dual=MVIO "Dual" (default)
AVRDB.menu.23_mvsyscfg.02_single.bootloader.mvsys_bit=10
AVRDB.menu.23_mvsyscfg.02_single=MVIO "Single"
AVRDB.menu.24_eeprom.01_keep.bootloader.eesave_bit=1
AVRDB.menu.24_eeprom.01_keep=Save guard "Retained"
AVRDB.menu.24_eeprom.02_erase.bootloader.eesave_bit=0
AVRDB.menu.24_eeprom.02_erase=Save guard "Erase"
AVRDB.menu.24_eeprom.03_upload.bootloader.eepupload={bootloader.eeprom}
AVRDB.menu.24_eeprom.03_upload.bootloader.eesave_bit=1
AVRDB.menu.24_eeprom.03_upload=Upload ".eep" file
AVRDB.menu.26_userrow.02_keep=Save guard "Retained"
AVRDB.menu.26_userrow.03_upload.bootloader.urowupload={bootloader.userrow}
AVRDB.menu.26_userrow.03_upload=Upload ".urow" file
AVRDB.menu.51_buildopt.01_Release=Build Release (default)
AVRDB.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDB.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDB.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDB.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDB.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDB.menu.52_macroapi.02_Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
AVRDB.menu.52_macroapi.02_Withoutboot=Macro API Enable without startup
AVRDB.menu.52_macroapi.03_Disable.build.macroapi=
AVRDB.menu.52_macroapi.03_Disable=Macro API Disable
AVRDB.menu.52_macroapi.04_AllDisable.build.macroapi=
AVRDB.menu.52_macroapi.04_AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1
AVRDB.menu.52_macroapi.04_AllDisable=Standard Library All Disable
AVRDB.menu.53_printf.01_default=default
AVRDB.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDB.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDB.menu.53_printf.02_full=Float Support
AVRDB.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRDB.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDB.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRDB.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDB.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRDB.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDB.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRDB.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDB.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRDB.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDB.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
AVRDB.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDB.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDB.menu.90_console_baud.20_separator=-
AVRDB.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDB.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRDB.menu.95_bootloader.01_UART0_A0_LA7.bootloader.file=hex/boot_avrdx_UART0_A0_{upload.speed}_LA7.hex
AVRDB.menu.95_bootloader.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDB.menu.95_bootloader.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7 (default)
AVRDB.menu.95_bootloader.10_separator=-
AVRDB.menu.95_bootloader.11_UART2_F0_LA7.bootloader.file=hex/boot_avrdx_UART2_F0_{upload.speed}_LA7.hex
AVRDB.menu.95_bootloader.11_UART2_F0_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7
AVRDB.menu.95_bootloader.11_UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7
AVRDB.menu.95_bootloader.12_UART2_F4_LA7.bootloader.file=hex/boot_avrdx_UART2_F4_{upload.speed}_LA7.hex
AVRDB.menu.95_bootloader.12_UART2_F4_LA7.build.console_select=-DSerial=Serial2B -DLED_BUILTIN=PIN_PA7
AVRDB.menu.95_bootloader.12_UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48/64pin)
AVRDB.menu.95_bootloader.20_separator=-
AVRDB.menu.95_bootloader.21_UART3_B0_LB3_SB2_Curiosity.bootloader.file=hex/boot_avrdb_UART3_B0_{upload.speed}_LB3.hex
AVRDB.menu.95_bootloader.21_UART3_B0_LB3_SB2_Curiosity.build.console_select=-DSerial=Serial3A -DLED_BUILTIN=PIN_PB3 -DSW_BUILTIN=PIN_PB2
AVRDB.menu.95_bootloader.21_UART3_B0_LB3_SB2_Curiosity=UART3 TX:PB0 RX:PB1 LED=PB3 SW=PB2 (AVR128DB48 Curiosity Nano)


